
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-1/actions/runs/5698648454)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ec2.aws_iam_role_policy_attachment.EC2_enable_SSM_connect_role_policy_attachment
  * module.ec2.module.EC2_enable_SSM_connect_policy.aws_iam_policy.policy[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ec2.aws_iam_role_policy_attachment.EC2_enable_SSM_connect_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "EC2_enable_SSM_connect_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-EC2-enable-SSM-connect-role"
    }

  # module.ec2.module.EC2_enable_SSM_connect_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "dev-EC2-enable-SSM-connect"
      + id          = (known after apply)
      + name        = "dev-EC2-enable-SSM-connect"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:DescribeAssociation",
                          + "ssm:GetDeployablePatchSnapshotForInstance",
                          + "ssm:GetDocument",
                          + "ssm:DescribeDocument",
                          + "ssm:GetManifest",
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:ListAssociations",
                          + "ssm:ListInstanceAssociations",
                          + "ssm:PutInventory",
                          + "ssm:PutComplianceItems",
                          + "ssm:PutConfigurePackageResult",
                          + "ssm:UpdateAssociationStatus",
                          + "ssm:UpdateInstanceAssociationStatus",
                          + "ssm:UpdateInstanceInformation",
                          + "ssm:SendCommand",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:CreateControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:OpenDataChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2messages:AcknowledgeMessage",
                          + "ec2messages:DeleteMessage",
                          + "ec2messages:FailMessage",
                          + "ec2messages:GetEndpoint",
                          + "ec2messages:GetMessages",
                          + "ec2messages:SendReply",
                          + "ec2:DescribeInstances",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":41,"Program":"tfcmt","SHA1":"6a91e33b22e683ccbdb225c75efb9d7f47a60886","Vars":{},"WorkflowName":"dev plan"} -->